InformationRegisters/СостоянияИнтеграцииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СостоянияИнтеграцииОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияИнтеграцииОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчетнаяСистема</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчетныеСистемыИнтеграцииОбластейДанных</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостоянияИнтеграцииОбъектов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура УстановитьСостояние(ДанныеЗаписи) Экспорт
    
    Менеджер = СоздатьМенеджерЗаписи();
    ЗаполнитьЗначенияСвойств(Менеджер, ДанныеЗаписи);
    Менеджер.Записать();
    
КонецПроцедуры

Функция НовыйДанныеЗаписи() Экспорт
	
    ДанныеЗаписи = Новый Структура;
    ДанныеЗаписи.Вставить("УчетнаяСистема");
    ДанныеЗаписи.Вставить("ИдентификаторОбъекта", "");
    ДанныеЗаписи.Вставить("Состояние", Перечисления.СостоянияИнтеграцииОбъектов.ПустаяСсылка());
    ДанныеЗаписи.Вставить("Описание", "");
    
    Возврат ДанныеЗаписи;
	
КонецФункции

#КонецОбласти

#КонецЕсли
